{
  "user": [
    {
      "id": "1",
      "email": "admin@events.com",
      "password": "admin123",
      "role": "admin"
    },
    {
      "id": "2",
      "email": "reader@events.com",
      "password": "reader123",
      "role": "reader"
    }
  ],
  "event": [
    {
      "id": "1",
      "name": "JavaScript Fundamentals Workshop",
      "date": "2025-08-15T09:00:00.000Z",
      "location": "São Paulo Tech Hub",
      "description": "Aprenda os fundamentos do JavaScript e as melhores práticas de programação. Workshop prático com exercícios hands-on e projetos reais para iniciantes e desenvolvedores que querem solidificar seus conhecimentos em JavaScript moderno.",
      "category": "Workshop"
    },
    {
      "id": "2",
      "name": "Data Science Conference Brazil",
      "date": "2025-07-22T08:30:00.000Z",
      "location": "Rio de Janeiro Convention Center",
      "description": "Explore as últimas tendências em machine learning e análise de dados. Conferência com palestrantes renomados do setor, cases práticos e networking com profissionais da área de ciência de dados no Brasil.",
      "category": "Conference"
    },
    {
      "id": "3",
      "name": "Cybersecurity Awareness Webinar",
      "date": "2025-09-10T15:00:00.000Z",
      "location": "Online - Google Meet",
      "description": "Proteja sua empresa contra ameaças cibernéticas com estratégias eficazes. Webinar abrangente sobre segurança digital, prevenção de ataques, boas práticas e como criar uma cultura de segurança organizacional.",
      "category": "Webinar"
    },
    {
      "id": "4",
      "name": "Entrepreneurs Networking Night",
      "date": "2025-08-28T18:00:00.000Z",
      "location": "Startup Café Florianópolis",
      "description": "Encontre empreendedores e investidores em um ambiente descontraído. Noite de networking com pitch sessions, palestras inspiradoras e oportunidades de conexão para expandir sua rede de contatos no ecossistema empreendedor.",
      "category": "Networking"
    },
    {
      "id": "5",
      "name": "Digital Marketing Bootcamp",
      "date": "2025-09-05T10:00:00.000Z",
      "location": "Marketing Institute Brasília",
      "description": "Transforme sua presença digital com estratégias eficazes de marketing. Webinar com especialistas abordando SEO, redes sociais, automação de marketing e como aumentar conversões online.",
      "category": "Other"
    },
    {
      "id": "6",
      "name": "Python for Beginners Workshop",
      "date": "2025-07-18T13:30:00.000Z",
      "location": "Code Academy Salvador",
      "description": "Aprenda Python desde o zero com instruções práticas e projetos reais. Workshop para iniciantes com foco em sintaxe, estruturas de dados, bibliotecas essenciais e desenvolvimento de aplicações básicas em Python.",
      "category": "Workshop"
    },
    {
      "id": "7",
      "name": "Blockchain Technology Summit",
      "date": "2025-09-12T09:00:00.000Z",
      "location": "Curitiba Innovation Center",
      "description": "Descubra o futuro das transações digitais com blockchain e criptomoedas. Conferência com especialistas internacionais explorando casos de uso, tecnologias emergentes e o impacto da blockchain nos negócios.",
      "category": "Conference"
    },
    {
      "id": "8",
      "name": "Remote Work Best Practices",
      "date": "2025-08-08T16:00:00.000Z",
      "location": "Online - Zoom Platform",
      "description": "Maximize sua produtividade trabalhando remotamente com dicas práticas. Webinar abordando organização pessoal, ferramentas de colaboração, comunicação eficaz e como manter o equilíbrio vida-trabalho.",
      "category": "Webinar"
    },
    {
      "id": "9",
      "name": "React Next.js Conference 2025",
      "date": "2025-10-15T14:00:00.000Z",
      "location": "São Paulo Convention Center",
      "description": "Participe da maior conferência de React e Next.js do Brasil. Evento com palestrantes internacionais, workshops práticos, networking e as últimas novidades do ecossistema React para desenvolvedores.",
      "category": "Conference"
    },
    {
      "id": "10",
      "name": "Advanced TypeScript Workshop",
      "date": "2025-10-22T09:00:00.000Z",
      "location": "Tech Hub Rio de Janeiro",
      "description": "Aprimore suas habilidades em TypeScript com conceitos avançados e práticas. Workshop focado em generics, decorators, advanced types, performance optimization e arquitetura de projetos TypeScript complexos.",
      "category": "Workshop"
    },
    {
      "id": "11",
      "name": "Cloud Architecture Webinar",
      "date": "2025-11-05T16:00:00.000Z",
      "location": "Online - Zoom Platform",
      "description": "Construa aplicações escaláveis na nuvem com arquiteturas modernas. Webinar cobrindo AWS, Azure, microserviços, containers, DevOps practices e estratégias de migração para cloud computing.",
      "category": "Webinar"
    },
    {
      "id": "12",
      "name": "Tech Startup Networking",
      "date": "2025-11-12T19:00:00.000Z",
      "location": "Innovation Hub Belo Horizonte",
      "description": "Conecte-se com fundadores de startups e investidores em um ambiente inovador. Evento de networking com pitch sessions, mentorias, discussões sobre tecnologia e oportunidades de investimento no setor tech.",
      "category": "Networking"
    },
    {
      "id": "13",
      "name": "AI Ethics Discussion Panel",
      "date": "2025-12-03T15:30:00.000Z",
      "location": "University of São Paulo",
      "description": "Participe do debate sobre ética em inteligência artificial e seus impactos sociais. Painel com especialistas discutindo responsabilidade tecnológica, vieses algorítmicos e o futuro da IA na sociedade.",
      "category": "Other"
    },
    {
      "id": "14",
      "name": "Mobile Development Workshop",
      "date": "2025-10-28T10:00:00.000Z",
      "location": "Digital Campus Recife",
      "description": "Desenvolva aplicações móveis multiplataforma com React Native e Flutter. Workshop prático abordando desenvolvimento híbrido, APIs nativas, performance mobile e publicação nas app stores.",
      "category": "Workshop"
    },
    {
      "id": "15",
      "name": "DevOps Best Practices Conference",
      "date": "2025-11-18T08:00:00.000Z",
      "location": "Porto Alegre Tech Center",
      "description": "Domine as melhores práticas de DevOps e automação de processos. Conferência com cases reais de CI/CD, containerização, monitoramento, infraestrutura como código e cultura DevOps em empresas brasileiras.",
      "category": "Conference"
    },
    {
      "id": "16",
      "name": "UX/UI Design Webinar Series",
      "date": "2025-10-30T14:00:00.000Z",
      "location": "Online - Microsoft Teams",
      "description": "Masterize design de experiência do usuário e interfaces intuitivas. Série de webinars cobrindo pesquisa UX, prototipagem, design systems, acessibilidade e tendências em design digital.",
      "category": "Webinar"
    }
  ]
}
